{
  "name": "Naitik Rajyaguru",
  "title": "Software Developer",
  "description": "Results-driven Software Developer with hands-on experience in building scalable web applications, AI-driven internal tools, and real-time collaborative platforms. Proficient in both frontend and backend development with additional exposure to automation, NLP, and system optimization. Adept at leveraging emerging technologies to solve real-world problems efficiently while delivering high-quality solutions.",
  "profilePhoto": "./profile.jpg",
  "resumeLink": "",
  "socialProfiles": [
    {
      "name": "LinkedIn",
      "link": "https://www.linkedin.com/in/naitik-rajyaguru/",
      "icon": "linkedin"
    },
    {
      "name": "GitHub",
      "link": "https://github.com/Naitik1Rajyaguru",
      "icon": "github"
    }
  ],
  "codingProfiles": [
    {
      "name": "LeetCode",
      "link": "https://leetcode.com/naitik_05/",
      "username": "naitik_05",
      "rating": ""
    },
    {
      "name": "Codeforces",
      "link": "https://codeforces.com/profile/naitikrajyaguru",
      "username": "naitikrajyaguru",
      "rating": ""
    }
  ],
  "skills": [
    {
      "title": "Frontend",
      "skills": [
        "HTML",
        "CSS",
        "JavaScript",
        "Angular (Basic)",
        "React (Basic)"
      ]
    },
    {
      "title": "Backend",
      "skills": [
        "Node.js (Basic)",
        ".NET (C#) (Basic)"
      ]
    },
    {
      "title": "Scripting",
      "skills": [
        "Python"
      ]
    },
    {
      "title": "Languages",
      "skills": [
        "C",
        "C++",
        "PHP"
      ]
    }
  ],
  "certifications": [],
  "education": [
    {
      "institution": "Nirma University",
      "degree": "Bachelor's Degree",
      "duration": "CGPA: 7.9",
      "description": "Completed undergraduate studies with a solid academic record and practical exposure to real-world projects in software development."
    }
  ],
  "projects": [
    {
      "title": "Automated News Updater",
      "duration": "",
      "description": "Developed a Python-based web scraping tool to extract and format daily news headlines from multiple websites. Designed a GUI for user registration with email and implemented an automated mailing system to send news summaries to registered users daily.",
      "githubLink": "https://github.com/Naitik1Rajyaguru/News-Summerizer",
      "liveLink": ""
    },
    {
      "title": "Real-time Collaborative Editor and Chat Platform",
      "duration": "",
      "description": "Built a socket-based multi-user chat application with real-time document collaboration functionality similar to Google Docs. Enabled simultaneous editing and communication among multiple users in shared spaces.",
      "githubLink": "https://github.com/Naitik1Rajyaguru/socker_multicommunication",
      "liveLink": "https://socker-multicommunication.onrender.com/"
    },
    {
      "title": "Movie Recommendation System",
      "duration": "",
      "description": "Implemented a content-based movie recommendation system using similarity metrics and NLP-driven user reviews. Developed a Streamlit-based Python interface to provide interactive movie suggestions.",
      "githubLink": "",
      "liveLink": ""
    },
    {
      "title": "Flappy Bird Game (Basic)",
      "duration": "",
      "description": "Created a simple version of the Flappy Bird game using Unity and C#, focusing on game logic, character motion, and interactive gameplay elements.",
      "githubLink": "https://github.com/Naitik1Rajyaguru/FlappyBird",
      "liveLink": ""
    }
  ],
  "experience": {
    "internship": [
      {
        "company": "Zeus Learning",
        "duration": "",
        "designation": "Software Developer Intern",
        "projectTitle": "Full Stack Job Profiler System",
        "description": "Developed a full stack job profiling platform using Angular, .NET, and MySQL. Enabled users to create profiles and register within the company portal efficiently."
      },
      {
        "projectTitle": "QA Automation System",
        "description": "Engineered an automated QA testing system to schedule and execute test cases at predefined intervals, generating detailed test execution reports to streamline the QA process."
      }
    ],
    "fulltime": [
      {
        "company": "Zeus Learning",
        "duration": "",
        "designation": "Software Developer",
        "projectTitle": "AI-Powered Internal Tools Suite",
        "description": "Led the development of multiple AI-driven internal tools that reduced organizational costs by approximately 60% using semantic caching and prompt caching strategies. Delivered key projects including:\n- A RAG-based chatbot for internal query handling.\n- An advanced SQL validator capable of detecting critical optimization rules to improve stored procedure and query performance by 70-80%.\n- An accessibility compliance assistant following WCAG standards for validating web content, images, text, and code blocks.\n- An adaptive system that personalizes user experiences based on system inputs.\n\nBuilt a CI/CD pipeline using Liquibase to automate SQL deployment and generate validation reports at push-time. Utilized Python, JavaScript, HTML, CSS, MongoDB, SQL, Pinecone, FAISS, and Liquibase, deployed on internal virtual machines."
      },
      {
        "projectTitle": "Authentication Microservices",
        "description": "Developed secure authentication microservices supporting both OAuth2 (two-token sliding window-based expiry system) and LDAP-based authentication for internal organizational tools. Provided seamless session management and integration with the organization's Active Directory."
      },
      {
        "projectTitle": "Content Simplification and Audio Generation Tool",
        "description": "Built a dynamic content simplification tool that adjusts text complexity based on age groups and generates real-time audio with word-level highlighting. Integrated multi-language support and contextual simplification features to make complex topics accessible to diverse user groups."
      },
      {
        "projectTitle": "Client LMS Performance Optimization",
        "description": "Worked on a live client Learning Management System (LMS) project based on PHP. Resolved critical SonarQube issues, optimized stored procedures and APIs, and successfully reduced query execution time by 80%, improving overall system responsiveness and efficiency."
      }
    ]
  },
  "hobbies": [
    "Vibe Coding",
    "Music",
    "Web Series/Movies",
    "Gaming"
  ],
  "contact": {
    "email": "naitikrajyaguru@gmail.com",
    "phone": "9924254848"
  }
}